

let score=0
let errors=0

let money=+localStorage.getItem('money')||0
$('#money_count').text(money)

let start= false;



let avatar=localStorage.getItem('selectedPers')

let avatars=JSON.parse(localStorage.getItem('pers'))
if(avatars)
avatars.map(item=>{
    if(item.id==avatar){
        $('.hero').css('background',`url(${item.img})`)
        $('.hero').css('background-size','100% 100%')
    }
})

let back = localStorage.getItem("selectedBg")
let backs = JSON.parse(localStorage.getItem("backs"))
if(backs)
backs.map(item=>{
    if(item.id == back){
        $('.wrapper').css('background', `url(${item.img})`)
        $('.wrapper').css('background-size', `100% 100%`)
    }
})

// cделать такое же подключение на wrapper фону
// let avatar=localStorage.getItem('selectedPers')

// let avatars=JSON.parse(localStorage.getItem('pers'))
// if(avatars)
// avatars.map(item=>{
//     if(item.id==avatar){
//         $('.hero').css('background',`url(${item.img})`)
//         $('.hero').css('background-size','100% 100%')
//     }
// })




let urok2=["папа оро папа жеж папа ОЛДЖ папа оро папа жеж папа ОЛДЖ папа оро папа жеж папа ОЛДЖ пала оро папа жеж папа ОЛДЖ папа оро папа жеж пана ОЛДЖ"]
let urok3=["алло папа алло оро алло Фалда алло пала алло оро алло Фалда алло папа алло оро алло Фалда алло папа алло оро алло Фалда алло папа алло оро алло Фалда"]
let urok4=["Алло фіва єжє алло папа джо алло алло фіва єже алло папа джо аалло фіва єже алло папа джо алло алло фіва єже алло папа дже алло алло фіва еже алло папа джо алло"]
let urok5=["вол ода жал вал лов лад ложа алло вода фалда жало важа льожа дона пара права дора поро алово профало арава арава арфа элла лара кофе перо декан декор пенал жена кадр кафе дрова дорога гонка"]
let urok6=["віл вал вів ложа лава ліжа пекло жало алло чекав лов лад віл вал вів ложа лава ліжа пекло жало алло чекав лов лад віл вал вів ложа лава ліжа пекло жало алло чекав лов лад дол дож дві овал віла гедзь ві вода валі ложа дав фал дол дож дві овал віла гедзь ві вода валі ложа дав фал дол дож дві овал віла ві веда валі ложа дав фал"]
let urok7=["ужак укол укор улов упек упор уран урна урок ушко уклад уклон укроп упрек шарж шарф шкаф шлаг шлак шнур шажок шквал шкода школа шкура шланг шокер шофер внук врун гуар душа каша ковш круг крупа фарш флешка вершок воркун вулкан гаврош грудка грушка дружок кожура колдун ландиш недруг опекун опушка плакун прогул угонка шнурок ловушка углевод журавленок"]
let urok8=["Фива олдж ждло авиф вол ода дар дож два оро эра жал вал лов лад дож джо пар паж ров эра вал лор пара вар пыл дав жар рад раж пэр фар ролл ржа род вор дор важа жало раж волы алоэ дрож форд радо вада алла лижа парад жара лава орлы пропал врода ворожа флора лора плов драп плыв лапа дары арап дыра форд фара права арфа"]
let urok1=["ао ао ао ао ао ао ао ао ао ао ао ао ао ао ао ао ао ао ал ал ал ал ал ал ал ал ал ал ал ал ал ал ал ал ал ал ол ол ол ол ол ол ол ол ол ол ол ол ол ол ол ол ол ол ВО ВО ВО ВО ВО ВО ВО ВО ВО ВО ВО ВО ВО ВО ВО ВО ВО ПіД ів ів ів ів ів ів ів ів ів ів ів ів ів ів ів ів ів ів"]
let urok9=["вал вой жар ква код кол лад пуд пол пар пыл рэп ажур вода волк двор дыра кадр кайф клад кода кожа край лупа парк плод вокал дужка кварц ложка оклад купол кураж пудра пожар ройка право рукав фураж повар выклад выплод двойка дружка журфак каждий кожура"]
let urok10=["купало порука подвал плужок плойка правий провал продув пружок прижок уводка ужовка уловка урожай флажок аеропил кружало лодижка лукавий подружка полуфрак продувка парад плав права"]
let urok11=["полова рада алло папа вода дыра порода варвара овал ложа олово провал фарфор оправа вправо фара провод овод"]
let urok12=["вивод парад плав права полова рада алло папа вода дыра порода варвара овал ложа олово провал фарфор оправа вправо фара провод овод продавал арфа аврора продажа плов арава провал форвард подвал провод довод правда радовал пропажа водопад провожал провал плавал проплывала пропадала провожала продажа фарфор"]
let urok13=["Для правильного понятия разных сигналов требуется разработка кода или кодирование."]
let urok14=["Код это система условных знаков для представления информации."]
let urok15=["Кодирование это перевод информации в удобную для передачи, обработки или хранения форму с помощью некоторого кода."]
let urok16=["Для передачи информации люди придумали специальные коды. Азбука Морзе это одни из способов знакового кодирования."]
let urok17=["Азбука Морзе появилась в конце тридцатых годов девятнадцатого века. Принцип её работы заключается в кодировании знаков и символов в виде длинных и коротких сигналов"]
let urok18=["Информация которую мы получаем из окружающего мира поступает к нам в виде условных знаков или сигналов самой разной физической природы. Для того чтобы произошла передача информации мы должны уметь принимать сигнал и расшифровать его."]
let urok19=["Мы с Вами живём в эпоху одного из самых значительных скачков в развитии человечества. Наше общество почти уже достигло той стадии, когда его уже с полной уверенностью можно будет назвать информационным."]
let urok20=["Каждый день мы лезем в Интернет за какой-нибудь информацией, чтобы поиграть в онлайн-игры или просто пообщаться с друзьями в социальных сетях или по скайпу. Многие в нём практически живут."]
let urok21=["Интернет - всемирная информационная компьютерная сеть, связывающая между собой как пользователей компьютерных сетей, так и пользователей индивидуальных компьютеров для обмена информацией."]
let urok22=["По сути, Интернет — это самая большая в мире компьютерная сеть, которая объединяет десятки тысяч сетей по всему миру."]
let urok23=["Первым днём жизни Интернета можно считать 29 октября 1969 года. Именно в этот день между двумя первыми узлами сети, которые находились друг от друга на расстоянии в 640 км., провели сеанс связи."]
let urok24=["Пробіл - це такий же знак як і літери. І друкувати його потрібно без паузи. Друкуйте рівно і без зупинок між словами. Дуже добре використовувати метроном. Ви можете 'включити' метроном у себе в голові. На кожен удар метронома - удар по клавішах, в тому числі і по пропуску, і по Enter . Зупинок бути не повинно. Рівномірність друку - найголовніша умова для подальшого нарощування швидкості."]

switch(+localStorage.getItem('lesson')||1){
    case 1:
        $('#text').val(urok1)
        break;
    case 2:
        $('#text').val(urok2)
        break;
    case 3:
        $('#text').val(urok3)
        break;

    case 4:
        $('#text').val(urok4)
        break;

    case 5:
        $('#text').val(urok5)
        break;        
        case 5:
        $('#text').val(urok5)
        break;   
        case 6:
        $('#text').val(urok6)
        break;   
        case 7:
        $('#text').val(urok7)
        break;   
        case 8:
        $('#text').val(urok8)
        break;   
        case 9:
        $('#text').val(urok9)
        break;   
        case 10:
        $('#text').val(urok10)
        break;   
        case 11:
        $('#text').val(urok11)
        break;   
        case 12:
        $('#text').val(urok12)
        break;   
        case 13:
        $('#text').val(urok13)
        break;   
        case 14:
        $('#text').val(urok14)
        break;   
        case 15:
        $('#text').val(urok15)
        break;   
        case 16:
        $('#text').val(urok16)
        break;   
        case 17:
        $('#text').val(urok18)
        break;   
        case 19:
        $('#text').val(urok19)
        break;   
        case 20:
        $('#text').val(urok20)
        break;   
        case 21:
        $('#text').val(urok21)
        break;   
        case 22:
        $('#text').val(urok22)
        break;   
        case 23:
        $('#text').val(urok23)
        break;   
        case 24:
        $('#text').val(urok24)
        break;   
}



$("body").keydown(function(event){



    if(start==false){
        if(event.key==' '){
            start=true
            $('.hero').show()
            $('.text').show()
            $('.start').hide()
        }
    }
    else{
        let text=$('#text').val().split('')

        if(event.key != 'Shift'&& event.key !='CapsLock' && event.key!='Alt'&&event.key!='Control'&&event.key!='Command'){
            if(event.key == text[0]){
                text.shift()
                $('#text').val(text.join(''))
                score++
                $('.score').text('Балів:' + score)
            }
            else{
                errors++
                $('.mistake').text('Помилки:' + errors)
            }
    
            if(text.length <1){
                localStorage.setItem('money',money+score-errors)
                $('#money_count').text(money)
    
                if(confirm('Урок завершен!Перейти на страницу уроов?'))
                {
                    location.href='lessons.html'
                }
                else{
                    location.reload()
                }
            }
        }
        else{

        }
    }

    


})

let timer
let speed=0
let time=1



timer = setInterval(function(){

    time++
    speed = Math. round (score/time*60)
    $('.speed').text('Швидкість:' + speed + " зн/хв")
    },1000)

$('#close').click(function(){
   close()
})
